<!-- dflook/terraform-github-actions {"workspace":"default","backend":"6087a939fd45535b32d973984db5e23132c40bfa5351ee8e04c1d47c756c7f13","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","plan_job_ref":"Job Test plan target and replace #260 at https://github.com/dflook/terraform-github-actions/actions/runs/3263967757","plan_hash":"b921cb1fdc51fe66ca4e30a1b6f421cc9981d31ffbda19ba174fc652ad72d438","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "4nZ4fhdIri" -> (known after apply)
  ~ foreach = "TVnRXb5CWk" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #260](https://github.com/dflook/terraform-github-actions/actions/runs/3263967757)